Tekla.Structures.Model.ContourPoint
The ContourPoint class defines a point with possible chamfering information,
used, for example, to define a contour plate.

Tekla.Structures.Model.ContourPoint.Chamfer
The chamfer for the contour point.

Tekla.Structures.Model.ContourPoint.#ctor
Creates a new contour point instance.

Tekla.Structures.Model.ContourPoint.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Model.Chamfer)
Creates a new contour point using the given point and chamfer.
P: The point (with X, Y and Z coordinates) to be used.
C: The chamfer to be used.

Tekla.Structures.Model.ContourPoint.SetPoint(Tekla.Structures.Geometry3d.Point)
Sets the point's coordinates for the contour point.
P: The point.